d = {'a': 12, 'v': 14, 'ж': 10, 'п': 23, 'm': 13, 'e': 16, 'я': 3, 'в': 6, 't': 24}
print(d)  # ВЫВОД - {'a': 12, 'в': 6, 'e': 16, 'я': 3, 'v': 14, 'ж': 10, 'm': 13, 'п': 23, 't': 24}

l = d.keys()  # получаем ключи
print(l)  # ВЫВОД - dict_keys(['a', 'в', 'e', 'я', 'v', 'ж', 'm', 'п', 't'])

l = list(l)  # превращаем его в обычный список
print(l)  # ВЫВОД - ['a', 'в', 'e', 'я', 'v', 'ж', 'm', 'п', 't']

l.sort()  # сортируем список
print(l)  # ВЫВОД - ['a', 'e', 'm', 't', 'v', 'в', 'ж', 'п', 'я']

for i in l:  # вывод элементов словаря (ключ - значение) по алфавиту
    print(i, '-', d[i], end='; ')  # ВЫВОД - a - 12; e - 16; m - 13; t - 24; v - 14; в - 6; ж - 10; п - 23; я - 3;